console.log("");
console.log("Example #1==========");
// Використовуйте цикл for для виведення всіх парних чисел від 0 до 10.
// Використовуйте оператор continue для пропуску непарних чисел.
for (let i = 0; i <= 10; i++) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(i);
}

console.log("");
console.log("Example #2==========");
// Створіть мітку skipTwo для циклу for.В циклі виводьте числа від 1 до 10. Коли змінна ітерації буде дорівнювати 2,
// використовуйте оператор continue з міткою skipTwo для пропуску цього кроку.
skipTwo: for (let i = 1; i <= 10; i++) {
  if (i === 2) {
    continue skipTwo;
  }
  console.log(i);
}

console.log("");
console.log("Example #3==========");
// Створіть змінну countdown і встановіть її значення на 10. Використовуйте цикл while для виведення значень від countdown до 1.
// Коли countdown досягне 5, використайте оператор break для зупинки циклу.
let countdown = 10;
while (countdown > 0) {
  console.log(countdown);
  countdown--;
  if (countdown == 5) break;
}

console.log("");
console.log("Example #4==========");
// Створіть змінну i і встановіть її значення на 0. Використовуйте цикл while для виведення значень від i до 10.
// Пропустіть значення 5, використавши оператор continue.
// let i3 = 0;
// while (i3 <= 10) {
//   if (i3 == 5) continue;
//   console.log(i3);
//   i3++;
// }

console.log("");
console.log("Example #5==========");
// Створіть змінну num і встановіть її значення на 0.
// Використовуйте цикл do...while для додавання 2 до num, поки num не буде більше 9.
let num = 0;
do {
  console.log("Task4", num);
  num += 2;
} while (num < 10);

console.log("");
console.log("Example #6==========");
// Створіть змінну x і встановіть її значення на 10. Використовуйте цикл do...while для виведення значень від x до 0.
// Коли x досягне 5, використайте оператор break для зупинки циклу.
let x = 10;
do {
  console.log(x);
  x--;
  if (x == 5) break;
} while (x > 0);

console.log("");
console.log("Example #7==========");
// Використовуйте цикл while для виведення чисел від 1 до 5.
let i = 1;
while (i <= 5) {
  console.log(i);
  i++;
}

console.log("");
console.log("Example #8==========");
// Створіть цикл for з двома лічильниками: i та j.Ініціалізуйте i зі значенням 0 та j зі значенням 10.
// З кожною ітерацією збільшуйте i на 1 та зменшуйте j на 1. Цикл повинен тривати, доки i не буде менше або дорівнює 10.
// Виведіть значення i та j на кожній ітерації.
for (let i = 0, j = 10; i <= 10; i++, j--) {
  console.log(i, j);
}

console.log("");
console.log("Example #9==========");
// Створіть цикл for з двома лічильниками: outer та inner.Обидва лічильники повинні починатися з 1.
// З кожною ітерацією збільшуйте outer на 1 та збільшуйте inner на 2.
// Цикл повинен тривати, доки outer не буде менше або дорівнює 5.
// Виведіть значення outer та inner на кожній ітерації.
for (let outer = 1, inner = 1; outer <= 5; outer++, inner += 2) {
  console.log(outer, inner);
}

console.log("");
console.log("Example #10==========");
// Створіть зовнішній лічильник i та ініціалізуйте його значенням 1.
// Використовуйте цикл for без ініціалізації внутрішнього лічильника, з умовою i <= 5 та з кроком збільшення 1.
// Виведіть значення i на кожній ітерації.
let i2 = 1;
for (; i2 <= 5; i2++) {
  console.log(i2);
}

console.log("");
console.log("Example #11==========");
// Створіть зовнішній лічильник count та ініціалізуйте його значенням 10.
// Використовуйте цикл for без ініціалізації внутрішнього лічильника, з умовою count >= 1 та з кроком зменшення 1.
// Виведіть значення count на кожній ітерації.
let count = 10;
for (; count >= 1; count--) {
  console.log(count);
}

console.log("");
console.log("Example #12==========");
// Ініціалізуйте лічильник j значенням зі 1 в циклі for, встановіть умову j <= 5, але не використовуйте крок збільшення в циклі.
// Замість цього, збільшуйте j на 1 всередині тіла циклу.Виведіть значення j на кожній ітерації.
for (let j = 1; j <= 5; ) {
  console.log(j);
  j++;
}

console.log("");
console.log("Example #13==========");
// Ініціалізуйте лічильник k зі значенням 10 в циклі for, встановіть умову k >= 1,
// але не використовуйте крок зменшення в циклі.Замість цього, зменшуйте k на 1 всередині тіла циклу.
// Виведіть значення k на кожній ітерації.
for (let k = 10; k >= 1; ) {
  console.log(k);
  k--;
}

console.log("");
console.log("Example #14==========");
// Створіть нескінчений цикл for без лічильника, умови та кроку.
// Виведіть надпис This will run once та використайте break всередині тіла циклу, щоб зупинити його після однієї ітерації.
for (;;) {
  console.log("This will run once");
  break;
}

console.log("");
console.log("Example #15==========");
// Створіть нескінчений цикл for без лічильника, умови та кроку.
// Використовуйте зовнішній лічильник z і виводьте його при кожній ітерації та break всередині тіла циклу,
// щоб зупинити цикл, коли z досягне 5.
let z = 1;
for (;;) {
  console.log(z);
  if (z >= 5) break;
  z++;
}

console.log("");
console.log("Example #16==========");
// Ініціалізуйте лічильник x зі значенням 1 в циклі for та збільшуйте його на 1 на кожному кроці,
// але не використовуйте умову в циклі.Замість цього, використовуйте break, щоб зупинити цикл, коли x більше 5.
// Виведіть значення x на кожній ітерації.
for (let x = 1; ; x++) {
  if (x > 5) break;
  console.log(x);
}

console.log("");
console.log("Example #17==========");
// Ініціалізуйте лічильник y зі значенням 10 в циклі for та зменшуйте y на 1 на кожному кроці,
// але не використовуйте умову в циклі.Замість цього, використовуйте break, щоб зупинити цикл, коли y менше 1.
// Виведіть значення y на кожній ітерації.
for (let y = 10; ; y--) {
  if (y < 1) break;
  console.log(y);
}

console.log("");
console.log("Example #18==========");
// Використовуйте цикл for з лічильником і, для виведення всіх чисел від 0 до 10, що не діляться на 3.
for (let i = 0; i <= 10; i++) {
  if (i % 3 != 0) console.log(i);
}

console.log("");
console.log("Example #19==========");
// Створіть зовнішній цикл for з лічильником i, який пройде від 1 до 3.
// Всередині цього циклу створіть внутрішній цикл for з лічильником j, який пройде від 1 до 3.
// Для кожної ітерації обох циклів виведіть в консоль рядок, що складається з значення лічильника зовнішнього циклу,
// символу долара та значення лічильника внутрішнього циклу.
for (let i = 1; i <= 3; i++) {
  for (let j = 1; j <= 3; j++) {
    console.log(i + "$" + j);
  }
}

console.log("");
console.log("Example #20==========");
// Створіть зовнішній цикл for з лічильником x, який пройде від 0 до 2.
// Всередині цього циклу створіть внутрішній цикл for з лічильником y, який пройде від 0 до 2.
// Для кожної ітерації обох циклів виведіть в консоль рядок, що складається з значення лічильника  зовнішнього циклу,
// двокрапки та значення лічильника внутрішнього циклу.
for (let x = 0; x <= 2; x++) {
  for (let y = 0; y <= 2; y++) {
    console.log(x + ":" + y);
  }
}

console.log("");
console.log("Example #21==========");
// Створіть зовнішній цикл while, який продовжується, поки змінна a, початкове значення якої 0, менше 3.
// Всередині цього циклу створіть внутрішній цикл while, який продовжується, поки змінна b, початкове значення якої 0,
// менше 3.При кожній ітерації циклу збільшуйте лічильник на 1.
// При кожній новій ітерації зовнішнього циклу b має повертатись до початкового значення.
// Для кожної ітерації обох циклів виведіть в консоль рядок, що складається з значення a, символу @та значення b.
// Не забудьте збільшити значення a та b у кожній ітерації.
let a = 0;
while (a < 3) {
  let b = 0;
  while (b < 3) {
    console.log(a + "@" + b);
    b++;
  }
  a++;
}

console.log("");
console.log("Example #22	==========");
// Створіть зовнішній цикл while, який продовжується, поки змінна m, початкове значення якої 0, менше або дорівнює 2.
// Всередині цього циклу створіть внутрішній цикл while, який продовжується, поки змінна n, початкове значення якої 0,
// менше або дорівнює 2.При кожній ітерації циклу збільшуйте лічильник на 1.
// При кожній новій ітерації зовнішнього циклу n має повертатись до початкового значення.
// Для кожної ітерації обох циклів виведіть в консоль рядок, що складається з значення m, символу # та значення n.
// Не забудьте збільшити значення m та n у кожній ітерації.
let m = 0;
while (m <= 2) {
  let n = 0;
  while (n <= 2) {
    console.log(m + "#" + n);
    n++;
  }
  m++;
}
